issueCertificateTemplate

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.protocol.core.ejbca.org/">
<soapenv:Header/>
<soapenv:Body>
<ws:certificateRequest>
	<!--arg0 is userData. We need to specify at least the subjectDN and profile.The rest of mandatory attributes may possibly have a fixed value?-->
 	<arg0>
		<caName>{{caName}}</caName>
	 	<clearPwd>FALSE</clearPwd>
		<certificateProfileName>{{certificateProfileName}}</certificateProfileName>
		<endEntityProfileName>{{endEntityProfileName}}</endEntityProfileName>
		{{#endTime}}<endTime>{{endTime}}</endTime>{{/endTime}}
		<keyRecoverable>FALSE</keyRecoverable>
		<sendNotification>FALSE</sendNotification>
		<status>10</status>
		<subjectDN>{{subjectDN}}</subjectDN>
   <!-- {{#email}}<subjectAltName>rfc822Name={{email}}</subjectAltName>{{/email}} -->
		<tokenType>USERGENERATED</tokenType>
		<username>{{username}}</username>
	 </arg0>
	 <!--arg1 is requestData. In our case it will be a SubjectPublicKeyInfo structure-->
	 <arg1>{{xmlCert}}</arg1>
	<!--arg2 is requestType. In our case, CERT_REQ_TYPE_PUBLICKEY, which is 3-->
	<arg2>3</arg2>
	<!--arg3 is hardTokenSN. Omitted in our case -->
	<!--arg4 is responseType. In our case, RESPONSETYPE_CERTIFICATE, which is "CERTIFICATE"-->
	<arg4>CERTIFICATE</arg4> 
</ws:certificateRequest>
</soapenv:Body>
</soapenv:Envelope>